libs/XML_Encryption_Attack_Library/src/test/resources/case_encKey_inside_encData_signed.xml

<soapenv:Envelope xmlns:nds="http://nds.rub.de" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
   <soapenv:Header><wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
<ds:Signature Id="Signature-5" xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
<ds:SignedInfo>
<ds:CanonicalizationMethod Algorithm="http://www.w3.org/TR/2001/REC-xml-c14n-20010315#WithComments"/>
<ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/>
<ds:Reference URI="#Body">
<ds:Transforms>
<ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/>
</ds:Transforms>
<ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/>
<ds:DigestValue>JxrAN1SoUejfElmCpVeSv35DOC4=</ds:DigestValue>
</ds:Reference>
</ds:SignedInfo>
<ds:SignatureValue>
AhlAftXEWAwOchl8ubB2mYDmG2mwb5KG5Vom6MztpaFNHGxb7I1HBApKLrzMC9uAEfjLCF6Jpxp3
dXZ+usUYkDJQ1H5iMbLQLTzoKsjNFAC30fhydMzoZb66Eu/fsnw8NHPKRDWyGuIXjlENqO7niN1Q
Zi6lDz+Z4W6tsN3jiVk=
</ds:SignatureValue>
<ds:KeyInfo Id="KeyId-C9A55361FEAEFBC1FF13329391533675">
<wsse:SecurityTokenReference wsu:Id="STRId-C9A55361FEAEFBC1FF13329391533676" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"><wsse:KeyIdentifier EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary" ValueType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-x509-token-profile-1.0#X509v3">MIICuDCCAiGgAwIBAgIBATANBgkqhkiG9w0BAQUFADB8MQswCQYDVQQGEwJERTEMMAoGA1UECAwDTlJXMQ8wDQYDVQQHDAZCb2NodW0xDDAKBgNVBAoMA1JVQjEQMA4GA1UECwwHWFNQUkVTUzEPMA0GA1UEAwwGVGVzdENBMR0wGwYJKoZIhvcNAQkBFg5UZXN0Q0FAeHNwcmVzczAeFw0xMTA4MDcxMjEyNDFaFw0xMjA4MDYxMjEyNDFaMEsxCzAJBgNVBAYTAkRFMQwwCgYDVQQIEwNOUlcxDDAKBgNVBAoTA1JVQjEQMA4GA1UECxMHWFNQUkVTUzEOMAwGA1UEAxMFQWxpY2UwgZ8wDQYJKoZIhvcNAQEBBQADgY0AMIGJAoGBANbijRO99DtXzOvjdp4jnXyErO9kdVehGpEOpEWqOFILPD18GcEJzJTKW4cVtBYsmp7QqTVWrFi47dJJPz2fwoB9WGpBbm4ufLAUA4rqNx+pLlmF9Hfk8Is1fdbP0xZQXg5nbrb1ZSfcAxqmtbsGBdV9WKvHjomBHcqMrDMnrc33AgMBAAGjezB5MAkGA1UdEwQCMAAwLAYJYIZIAYb4QgENBB8WHU9wZW5TU0wgR2VuZXJhdGVkIENlcnRpZmljYXRlMB0GA1UdDgQWBBRrbsxJOAq7vP95fcrG2XsydeWp7zAfBgNVHSMEGDAWgBS9VS/73EZbsbTvp/6JnrV6scVelzANBgkqhkiG9w0BAQUFAAOBgQBh5nYPzkfCnt44FpR3GpxQtrROfqKIef04hfudeyNboLiH2dG/Bb8DDygl1iOZKQ5CPx5mpsKOIzGzraWrhhWZ+taAFqGnfjrTcDqL1LSsKEKkFSIJbR6GIIluZOCRs0OUYxsn5lSNubPJsUxiiW2YDMZlbKZX7a6siyPY+pUFjQ==</wsse:KeyIdentifier></wsse:SecurityTokenReference>
</ds:KeyInfo>
</ds:Signature><wsu:Timestamp wsu:Id="Timestamp-4" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"><wsu:Created>2012-03-28T12:52:33.360Z</wsu:Created><wsu:Expires>2012-03-28T13:17:33.360Z</wsu:Expires></wsu:Timestamp></wsse:Security></soapenv:Header>
   <soapenv:Body Id="Body">
      <nds:pay>
         <!--Optional:-->
         <nds:name>XML-Security</nds:name>
         <!--Optional:-->
         <nds:amount>4000</nds:amount>
         <!--Optional:-->
         <nds:bankAccountNumber Id="1">
		 <xenc:EncryptedData Id="ED-2" Type="http://www.w3.org/2001/04/xmlenc#Content" xmlns:xenc="http://www.w3.org/2001/04/xmlenc#">
		 <xenc:EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#aes128-cbc"/>
		 <ds:KeyInfo xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
		<xenc:EncryptedKey Id="EncKeyId-urn:uuid:64DB4A7E53F67EF3F112142272504712">
               <xenc:EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#rsa-1_5"/>
               <xenc:CipherData>
                  <xenc:CipherValue>Y1G4IvsVfHLHWEW89D7wC7wVYfks1/Q5JHru0NaZlDE89rRTIITZrjjS6ajcXcjNiRcQMbElYoG4tnfXOyqOYYPAWaBGXbQIQo+jFZq+hHfYt+j8YrOP8hg9uELzwtmPT7GAv1bFn+dEwEU6Ez5ZdCVH0cImWcf1fdezMkxvXcY=</xenc:CipherValue>
               </xenc:CipherData>
            </xenc:EncryptedKey>
		 </ds:KeyInfo>
		 <xenc:CipherData>
		 <xenc:CipherValue>UM2LlzEpNjpgdupv3Kd6ELb4q2HxR4ligF9WOIIbXMU=</xenc:CipherValue>
		 </xenc:CipherData>
		 </xenc:EncryptedData>
		 </nds:bankAccountNumber>
      </nds:pay>
   </soapenv:Body>
</soapenv:Envelope>
